### Part II: Baseball Data

We will be working with the Lahman baseball data we uploaded to your AWS instance in class.

In [1]:
from sqlalchemy import create_engine
import pandas as pd
cnx = create_engine('postgresql://evaward:Metis@54.149.41.49:5432/evaward')

In [11]:
pd.read_sql_query('''
                    SELECT * 
                    FROM allstarfull
                    LIMIT 5
                    ''', cnx)

    playerid  yearid gamenum        gameid teamid lgid gp startingpos
0  gomezle01    1933       0  ALS193307060    NYA   AL  1           1
1  ferreri01    1933       0  ALS193307060    BOS   AL  1           2
2  gehrilo01    1933       0  ALS193307060    NYA   AL  1           3
3  gehrich01    1933       0  ALS193307060    DET   AL  1           4
4  dykesji01    1933       0  ALS193307060    CHA   AL  1           5

In [12]:
pd.read_sql_query('''
                    SELECT * 
                    FROM salaries
                    LIMIT 5''', cnx)

   yearid teamid lgid   playerid     salary
0    1985    BAL   AL  murraed02  1472819.0
1    1985    BAL   AL   lynnfr01  1090000.0
2    1985    BAL   AL  ripkeca01   800000.0
3    1985    BAL   AL   lacyle01   725000.0
4    1985    BAL   AL  flanami01   641667.0

1\. What was the total spent on salaries by each team, each year?

In [16]:
pd.read_sql_query('''
                    SELECT teamid, yearid, sum(salary)
                    FROM salaries
                    GROUP BY teamid, yearid
                    LIMIT 5''', cnx)

  teamid  yearid          sum
0    SLN    2009   88528409.0
1    KCA    1995   29532834.0
2    ANA    1999   55388166.0
3    SEA    2007  106460833.0
4    PHI    1991   22487332.0

2\. What is the first and last year played for each player?

_Hint:_ Create a new table from 'Fielding.csv'.

In [22]:
pd.read_sql_query('''
                    SELECT playerID, min(yearID), max(yearID)
                    FROM fielding
                    GROUP BY playerID
                    LIMIT 5''', cnx)

    playerid     min     max
0  gagnied01  1914.0  1915.0
1  ramospe01  1955.0  1970.0
2  putkolu01  2012.0  2013.0
3  boyerke01  1955.0  1969.0
4  dillibo01  1946.0  1951.0

3\. Who has played the most all star games?

In [26]:
pd.read_sql_query('''
                    SELECT playerID, COUNT(gamenum) AS tot_games
                    FROM allstarfull
                    GROUP BY playerID
                    ORDER BY tot_games DESC 
                    LIMIT 1''', cnx)

    playerid  tot_games
0  aaronha01         25

4\. Which school has generated the most distinct players? 

_Hint:_ Create a new table from 'Schools.csv' and 'SchoolsPlayers.csv'

In [27]:
pd.read_sql_query('''
                    SELECT schoolID, COUNT (DISTINCT playerID) AS num_players
                    FROM schoolPlayers
                    GROUP BY schoolID
                    ORDER BY num_players DESC 
                    LIMIT 1''', cnx)

  schoolid  num_players
0      usc          102

5\. Which players have the longest career? Assume that the `debut` and `finalGame` columns comprise the start and end, respectively, of a player's career. 

_Hint:_ Create a new table from 'Master.csv'. Also note that strings can be converted to dates using the [DATE](https://wiki.postgresql.org/wiki/Working_with_Dates_and_Times_in_PostgreSQL#WORKING_with_DATETIME.2C_DATE.2C_and_INTERVAL_VALUES) function and can then be subtracted from each other yielding their difference in days.

In [62]:
pd.read_sql_query('''
                    SELECT nameFirst, nameLast, (DATE(finalGame)-DATE(debut)) as tenure
                    FROM Master
                    WHERE finalGame != 'None' AND debut != 'None'
                    ORDER BY tenure DESC
                    LIMIT 5''', cnx)

  namefirst  namelast  tenure
0      Nick   Altrock   12862
1       Jim  O'Rourke   11836
2    Minnie    Minoso   11492
3   Charley   O'Leary   11126
4     Arlie    Latham   10678

6\. What is the distribution of debut months? Hint: Look at the DATE and [EXTRACT](https://www.postgresql.org/docs/current/static/functions-datetime.html#FUNCTIONS-DATETIME-EXTRACT) functions.

In [66]:
pd.read_sql_query('''
                    SELECT EXTRACT(MONTH FROM DATE(debut)) as month, COUNT(*) as num_players
                    FROM Master
                    WHERE finalGame != 'None' AND debut != 'None'
                    GROUP BY month
                    ORDER BY month
                    ''', cnx)

   month  num_players
0    3.0           41
1    4.0         4711
2    5.0         2230
3    6.0         1893
4    7.0         1978
5    8.0         1943
6    9.0         5061
7   10.0          308

7\. What is the effect of table join order on mean salary for the players listed in the main (master) table? 

_Hint:_ Perform two different queries, one that joins on playerID in the salary table and other that joins on the same column in the master table. You will have to use left joins for each since right joins are not currently supported with SQLalchemy.

In [70]:
pd.read_sql_query('''SELECT *
                    FROM Salaries
                    LIMIT 1
                    ''', cnx)

   yearid teamid lgid   playerid     salary
0    1985    BAL   AL  murraed02  1472819.0

In [71]:
pd.read_sql_query('''SELECT *
                    FROM Master
                    LIMIT 1
                    ''', cnx)

,playerid,birthyear,birthmonth,birthday,birthcountry,birthstate,birthcity,deathyear,deathmonth,deathday,...,namelast,namegiven,weight,height,bats,throws,debut,finalgame,retroid,bbrefid
0,aardsda01,1981.0,12.0,27.0,USA,CO,Denver,None,None,None,...,Aardsma,David Allan,205.0,75.0,R,R,2004-04-06,2013-09-28,aardd001,aardsda01

In [81]:
pd.read_sql_query('''SELECT nameFirst, nameLast, AVG(salary) as mean_salary
                    FROM Salaries
                    LEFT JOIN Master ON Salaries.playerid = Master.playerid
                    GROUP BY nameFirst, nameLast
                    ORDER BY mean_salary DESC
                    LIMIT 5
                    ''', cnx)

  namefirst   namelast   mean_salary
0      Alex  Rodriguez  1.777081e+07
1     Derek      Jeter  1.403434e+07
2      Mark   Teixeira  1.322955e+07
3      Ryan     Howard  1.315688e+07
4        CC   Sabathia  1.230357e+07

In [86]:
pd.read_sql_query('''SELECT nameFirst, nameLast, AVG(salary) as mean_salary
                    FROM Master
                    LEFT JOIN Salaries ON Master.playerid = Salaries.playerid
                    GROUP BY nameFirst, nameLast
                    ORDER BY mean_salary DESC
                    LIMIT 5
                    ''', cnx)

  namefirst   namelast mean_salary
0      John     Poloni        None
1     Ernie      Baker        None
2      Herm  McFarland        None
3      Dick    Siebert        None
4    Dickey     Pearce        None